"use strict";
// Задача 8. При старті питаємо у користувача чи хоче він читати новини. 
// Якщо так, то одразу переходимо до сайту Ukr.Net, якщо ні, 
// то через 20 секунд самі переходимо на сайт ukr.net. 
// Для цього через 20 секунд після відкриття треба виконати команду
if (confirm('Почати тестування?')) {
    const userAnswer = prompt(`Ви хочете читати новини?(y/n)`);
    if (userAnswer === 'y') {
        window.location.href = 'https://www.ukr.net/';
    }
    else {
        alert("Через 20 секунд ви будете автоматично перенаправлені на ukr.net");
        setTimeout(() => {
            window.location.href = 'https://www.ukr.net/';
        }, 20000);
    }
}
